---
type: RevitEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# RevitEventArgs

`Autodesk.Revit.DB.Events.RevitEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Cancel | — | `public virtual bool Cancel { get ; set ; }` |
| Property | Cancellable | — | `public virtual bool Cancellable { get ; }` |